---
kind: method
id: M:Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetSelectedElements
source: html/4b367193-5eb7-5c28-cec9-6534f85f00f2.htm
---
# Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetSelectedElements Method

Returns ElementIds of selected elements.

## Syntax (C#)
```csharp
public ISet<ElementId> GetSelectedElements()
```